import 'package:anabolic_compendium/models/drug_description.dart';
import 'package:anabolic_compendium/models/drug_form_enum.dart';

List<DrugDescription> aasListRU = [
  DrugDescription(
    drugGroup: 'Производные дигидротестостерона',
    drugNameExact: '1-тестостерон',
    drugNameAliases: [
      '1-Testo',
      'δ1-дигидротестостерон',
      '17β-гидрокси-5α-андрост-1-ен-3-он',
      'Дигидроболденон',
      'Андростендолон',
    ],
    androgenicAnabolicRatio: 'Андрогенная 100, анаболическая 200',
    drugRForm: DrugForm.pill,
    eliminationHalfLife: '4-6 часов',
    durationOfAction: 'До 24 часов',
    drugUsageSport: [
      'Объем мышц: применяется достаточно активно. По мощности сравним с метенолона энантатом (примоболаном) либо болденоном.',
      'Рост силовых показателей: может применяться. Повышение силовых показателей происходит, в основном, за счет повышения агрессивности.',
      'Повышение выносливости: используется редко. Тем не менее, находит применение в единоборствах — также за счет способности повышать агрессивность.',
      'Подготовка к соревнованиям, «сжигание» жира: применяется активно. Способен обеспечить неплохой «драйв» во время диеты.',
      'Антивозрастная терапия: может использоваться, учитывая предостережения.',
    ],
    drugPartners: [
      'Тестостерон',
      'Хлордегидрометилтестостерон (туринабол)',
      'Оксандролон',
    ],
    drugRFormText: 'Таблетки либо капсулы для перорального приема',
    drugDosageText: [
      'Минимальная дозировка: 150 мг в сутки.',
      'Максимальная дозировка: 300 мг в сутки.',
      'Доза разбивается на 4 приема.',
    ],
    keyChars: [
      'Мощный андроген.',
      'Обладает высоким сродством к андрогенным рецепторам.',
      'Способствует увеличению веса печени.',
      'Проявляет антиэстрогенную активность.',
    ],
    drugDescription: [
      '1-Тестостерон – анаболический стероид, отличающийся от тестостерона наличием двойной связи в положении 1,2 вместо положения 4,5. Является одним из первых синтетических анаболических стероидов: его синтезировали впервые еще в 1950 году, но в производство не запустили.',
      'Молекулы вещества обладают очень высоким сродством к андрогенным рецепторам (АР)— практически таким же, как и у тестостерона. Касается это и присоединения к АР в простате, семенных пузырьках; несколько более слабо молекула 1-тестостерона присоединяется к АР в кожном покрове головы и тела. А это означает, что препарат обладает выраженной андрогенной активностью.',
    ],
    drugCautions:
        'Под возлействием 1-тестостерона происходит увеличение веса печени.',
    sideEffects: [
      'Подавляет секрецию собственного тестостерона, но не очень существенно.',
      'Способствует повышению либидо.',
      'Негативное влияние на печень: очень сильное.',
      'Негативное влияние на почки: нет.',
      'Негативное влияние на сердечно-сосудистую систему: нет.',
      'Повышенная агрессивность: возможно.',
      'Выпадение волос на голове, рост волос на теле: редко.',
      'Акне: возможно.',
      'Гинекомастия: нет.',
    ],
    forWomen: 'Не рекомендован',
    realQuantity: 'Соответствует заявленному',
  ),
  DrugDescription(
    drugGroup: 'Производные дигидротестостерона',
    drugNameExact: '1-тестостерона ципионат',
    drugNameAliases: [
      '1-Testo',
      'δ1-дигидротестостерон',
      '17β-гидрокси-5α-андрост-1-ен-3-он',
      'Дигидроболденон',
      'Андростендолон',
    ],
    androgenicAnabolicRatio: 'Андрогенная 100, анаболическая 200',
    drugRForm: DrugForm.needle,
    eliminationHalfLife: '4-6 суток',
    durationOfAction: 'До 12 суток',
    drugUsageSport: [
      'Объем мышц: применяется достаточно активно. По мощности сравним с метенолона энантатом (примоболаном) либо болденоном.',
      'Рост силовых показателей: может применяться. Повышение силовых показателей происходит, в основном, за счет повышения агрессивности.',
      'Повышение выносливости: используется редко. Тем не менее, находит применение в единоборствах — также за счет способности повышать агрессивность.',
      'Подготовка к соревнованиям, «сжигание» жира: применяется активно. Способен обеспечить неплохой «драйв» во время диеты.',
      'Антивозрастная терапия: может использоваться, учитывая предостережения.',
    ],
    drugPartners: [
      'Тестостерон',
      'Хлордегидрометилтестостерон (туринабол)',
      'Станозолол',
      'Оксандролон',
    ],
    drugRFormText: 'Масляный раствор для внутримышечных инъекций.',
    drugDosageText: [
      'Оптимальная разовая доза: 200 мг.',
      'Периодичность инъекций: раз в 6 дней.',
    ],
    keyChars: [
      'Мощный андроген.',
      'Обладает высоким сродством к андрогенным рецепторам.',
      'Способствует увеличению веса печени.',
      'Проявляет антиэстрогенную активность.',
    ],
    drugDescription: [
      '1-Тестостерон – анаболический стероид, отличающийся от тестостерона наличием двойной связи в положении 1,2 вместо положения 4,5. Является одним из первых синтетических анаболических стероидов: его синтезировали впервые еще в 1950 году, но в производство не запустили.',
      'Молекулы вещества обладают очень высоким сродством к андрогенным рецепторам (АР)— практически таким же, как и у тестостерона. Касается это и присоединения к АР в простате, семенных пузырьках; несколько более слабо молекула 1-тестостерона присоединяется к АР в кожном покрове головы и тела. А это означает, что препарат обладает выраженной андрогенной активностью.',
    ],
    drugCautions:
        'Под возлействием 1-тестостерона происходит увеличение веса печени.',
    sideEffects: [
      'Подавляет секрецию собственного тестостерона, но не очень существенно.',
      'Способствует повышению либидо.',
      'Негативное влияние на печень: сильное.',
      'Негативное влияние на почки: нет.',
      'Негативное влияние на сердечно-сосудистую систему: нет.',
      'Повышенная агрессивность: возможно.',
      'Выпадение волос на голове, рост волос на теле: редко.',
      'Акне: возможно.',
      'Гинекомастия: нет.',
    ],
    forWomen: 'Не рекомендован',
    realQuantity:
        '100 мг масляного раствора содержит примерно 70 мг собственно 1-тестостерона. ',
  ),
];
